snlkuharlocal/src/Documents/Посылка/Посылка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Посылка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПосылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержимое</name>
    <attributes>
      <name>ЛистНабора</name>
      <type>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказовВЛНПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказовВЛНФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/Посылка/ManagerModule.bsl
Функция ПечатьЭтикетки (Ссылка) экспорт
	ТабДок=новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати="ДокументПосылка";
	Макет=ПолучитьМакет("ЭтикеткаШК");
	
	ОблЭтикетка=макет.ПолучитьОбласть("Строка");
	ЗаполнитьЗначенияСвойств(ОблЭтикетка.Параметры,Ссылка);
	ОблЭтикетка.Параметры.ДатаОтгрузки=Формат(ОблЭтикетка.Параметры.ДатаОтгрузки, "ДФ=dd.MM.yy");
	ТЗРНК=Ссылка.Содержимое.выгрузить(,"Документ");
	ТЗРНК.свернуть("Документ");
	
	
	
	ОблЭтикетка.Параметры.КоличествоНакладных = ТЗРНК.Количество();
	
	Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл	
		ОбъектШК			=Рисунок.Объект;
		ОбъектШК.Сообщение	=ПолучитьРеквизитШапки(Ссылка,"ШКПосылки","Документ");
	КонецЦикла;
	// Кухарь А.Ю.  03.11.2022 начало
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ТЗ.Документ КАК Документ
	              |ПОМЕСТИТЬ ВремТЗ
	              |ИЗ
	              |	&ТЗ КАК ТЗ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВремТЗ.Документ.Номер КАК Документ
	              |ИЗ
	              |	ВремТЗ КАК ВремТЗ";
	запрос.УстановитьПараметр("ТЗ",ТЗРНК);
	Результат=запрос.Выполнить().Выгрузить();

	МассивНомеров=новый Массив;
	для каждого СтрТЗ из Результат цикл
		МассивНомеров.Добавить((СтрТЗ.Документ));
	КонецЦикла;
	ОблЭтикетка.Параметры.НомераНакладных=СтрСоединить(МассивНомеров,", ");
	// Кухарь А.Ю.  03.11.2022 конец
	
	
	 табдок.Вывести(ОблЭтикетка);
	 возврат ТабДок;
КонецФункции
